"The Unarchiver/Unarchive To Current Folder" = "The Unarchiver/Extrair Para a Pasta Atual";

"The Unarchiver/Unarchive To Desktop" = "The Unarchiver/Extrair Para a Área de Trabalho";

"The Unarchiver/Unarchive To..." = "The Unarchiver/Extrair Para...";
